I'm not seeing this occur with the following:
- vSphere 7.0 Update 3a (7.0.3.00100)
- Terraform v1.0.9
- Terraform Provider for vSphere v2.0.2

Below is the configuration snippet which is similar to the reported.

```hcl
data "vsphere_distributed_virtual_switch" "vds" {
  depends_on = [
    vsphere_distributed_virtual_switch.vds
  ]
  name          = "foo"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

resource "vsphere_distributed_virtual_switch" "vds" {
  name            = "foo"
  description     = "foo"
  datacenter_id   = data.vsphere_datacenter.datacenter.id
  version         = "7.0.2"
  teaming_policy  = "loadbalance_srcid"
  uplinks         = ["uplink1", "uplink2", "uplink3", "uplink4"]
  active_uplinks  = ["uplink1", "uplink2"]
  standby_uplinks = ["uplink3", "uplink4"]
}

resource "vsphere_distributed_port_group" "dvpg" {
  name                            = "bar"
  vlan_id                         = 2000
  distributed_virtual_switch_uuid = data.vsphere_distributed_virtual_switch.vds.id
  active_uplinks                  = ["uplink1", "uplink2"]
  allow_mac_changes = true
  allow_forged_transmits = true
  allow_promiscuous = true
}
```

The result is as seen below:

<img width="736" alt="image" src="https://user-images.githubusercontent.com/7771363/139500448-267b9edb-2883-40d6-8998-95d710db2998.png">

If I update the configuration of the VLAN...

```hcl
resource "vsphere_distributed_port_group" "dvpg" {
  # ... other configs...
  vlan_id                         = 2000
  # ... other configs....
}
```

The results of `terraform plan` are seen below

```bash
$ terraform plan
vsphere_distributed_virtual_switch.vds: Refreshing state... [id=50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26]
vsphere_distributed_port_group.dvpg: Refreshing state... [id=dvportgroup-18019]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # vsphere_distributed_port_group.dvpg will be updated in-place
  ~ resource "vsphere_distributed_port_group" "dvpg" {
        id                                     = "dvportgroup-18019"
        name                                   = "bar"
        tags                                   = []
      ~ vlan_id                                = 2000 -> 2001
        # (41 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```

The results of `terraform apply --auto-approve` are seen below:

```bash
johnsonryan@johnsonryan-a03 ~/D/i/dvs> terraform apply --auto-approve
vsphere_distributed_virtual_switch.vds: Refreshing state... [id=50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26]
vsphere_distributed_port_group.dvpg: Refreshing state... [id=dvportgroup-18019]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # vsphere_distributed_port_group.dvpg will be updated in-place
  ~ resource "vsphere_distributed_port_group" "dvpg" {
        id                                     = "dvportgroup-18019"
        name                                   = "bar"
        tags                                   = []
      ~ vlan_id                                = 2000 -> 2001
        # (41 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
vsphere_distributed_port_group.dvpg: Modifying... [id=dvportgroup-18019]
vsphere_distributed_port_group.dvpg: Modifications complete after 0s [id=dvportgroup-18019]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```

Which results in the successful change seen below....

<img width="1136" alt="image" src="https://user-images.githubusercontent.com/7771363/139501058-a327ae77-e758-476f-b220-073c5ef6ffea.png">

It was mentioned that this was seen with changes to the description as well. The following test this scenario.

Here's the status of the VDS named `foo` with a description of `foo`.

<img width="912" alt="image" src="https://user-images.githubusercontent.com/7771363/139501318-08ed9a4d-3adc-479d-8a09-a92570f125da.png">

Let's change the description to `foo foo foo`

```hcl
resource "vsphere_distributed_virtual_switch" "vds" {
  name            = "foo"
  description     = "foo foo foo"
  datacenter_id   = data.vsphere_datacenter.datacenter.id
  version         = "7.0.2"
  teaming_policy  = "loadbalance_srcid"
  uplinks         = ["uplink1", "uplink2", "uplink3", "uplink4"]
  active_uplinks  = ["uplink1", "uplink2"]
  standby_uplinks = ["uplink3", "uplink4"]
}

resource "vsphere_distributed_port_group" "dvpg" {
  name                            = "bar"
  vlan_id                         = 2001
  distributed_virtual_switch_uuid = data.vsphere_distributed_virtual_switch.vds.id
  active_uplinks                  = ["uplink1", "uplink2"]
  allow_mac_changes = true
  allow_forged_transmits = true
  allow_promiscuous = true
}
```

The results of `terraform plan` are seen below...

```bash
s> terraform plan
vsphere_distributed_virtual_switch.vds: Refreshing state... [id=50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26]
vsphere_distributed_port_group.dvpg: Refreshing state... [id=dvportgroup-18019]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.vsphere_distributed_virtual_switch.vds will be read during apply
  # (config refers to values not yet known)
 <= data "vsphere_distributed_virtual_switch" "vds"  {
      ~ id            = "50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26" -> (known after apply)
        name          = "foo"
      ~ uplinks       = [
          - "uplink1",
          - "uplink2",
          - "uplink3",
          - "uplink4",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # vsphere_distributed_port_group.dvpg must be replaced
-/+ resource "vsphere_distributed_port_group" "dvpg" {
      ~ block_all_ports                        = false -> (known after apply)
      - block_override_allowed                 = false -> null
      ~ check_beacon                           = false -> (known after apply)
      ~ config_version                         = "2" -> (known after apply)
      - custom_attributes                      = {} -> null
      ~ directpath_gen2_allowed                = false -> (known after apply)
      ~ distributed_virtual_switch_uuid        = "50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26" -> (known after apply) # forces replacement
      ~ egress_shaping_average_bandwidth       = 100000000 -> (known after apply)
      ~ egress_shaping_burst_size              = 104857600 -> (known after apply)
      ~ egress_shaping_enabled                 = false -> (known after apply)
      ~ egress_shaping_peak_bandwidth          = 100000000 -> (known after apply)
      ~ failback                               = true -> (known after apply)
      ~ id                                     = "dvportgroup-18019" -> (known after apply)
      ~ ingress_shaping_average_bandwidth      = 100000000 -> (known after apply)
      ~ ingress_shaping_burst_size             = 104857600 -> (known after apply)
      ~ ingress_shaping_enabled                = false -> (known after apply)
      ~ ingress_shaping_peak_bandwidth         = 100000000 -> (known after apply)
      ~ key                                    = "dvportgroup-18019" -> (known after apply)
      ~ lacp_enabled                           = false -> (known after apply)
      ~ lacp_mode                              = "passive" -> (known after apply)
      - live_port_moving_allowed               = false -> null
        name                                   = "bar"
      ~ netflow_enabled                        = false -> (known after apply)
      - netflow_override_allowed               = false -> null
      - network_resource_pool_override_allowed = false -> null
      ~ notify_switches                        = true -> (known after apply)
      ~ number_of_ports                        = 0 -> (known after apply)
      - port_config_reset_at_disconnect        = false -> null
      + port_private_secondary_vlan_id         = (known after apply)
      - security_policy_override_allowed       = false -> null
      - shaping_override_allowed               = false -> null
      ~ standby_uplinks                        = [] -> (known after apply)
      - tags                                   = [] -> null
      ~ teaming_policy                         = "loadbalance_srcid" -> (known after apply)
      - traffic_filter_override_allowed        = false -> null
      ~ tx_uplink                              = false -> (known after apply)
      - uplink_teaming_override_allowed        = false -> null
      - vlan_override_allowed                  = false -> null
        # (8 unchanged attributes hidden)

      + vlan_range {
          + max_vlan = (known after apply)
          + min_vlan = (known after apply)
        }
    }

  # vsphere_distributed_virtual_switch.vds will be updated in-place
  ~ resource "vsphere_distributed_virtual_switch" "vds" {
      ~ description                       = "foo" -> "foo foo foo"
        id                                = "50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26"
        name                              = "foo"
        tags                              = []
        # (83 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```

And the results of the `terraform apply --auto-approve are seen below:

```bash
> terraform apply --auto-approve
vsphere_distributed_virtual_switch.vds: Refreshing state... [id=50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # vsphere_distributed_virtual_switch.vds has been changed
  ~ resource "vsphere_distributed_virtual_switch" "vds" {
      ~ config_version                    = "2" -> "3"
      ~ description                       = "foo foo foo" -> "foo"
        id                                = "50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26"
        name                              = "foo"
        tags                              = []
        # (82 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.vsphere_distributed_virtual_switch.vds will be read during apply
  # (config refers to values not yet known)
 <= data "vsphere_distributed_virtual_switch" "vds"  {
      + datacenter_id = "datacenter-3"
      + id            = (known after apply)
      + name          = "foo"
      + uplinks       = (known after apply)
    }

  # vsphere_distributed_port_group.dvpg will be created
  + resource "vsphere_distributed_port_group" "dvpg" {
      + active_uplinks                    = [
          + "uplink1",
          + "uplink2",
        ]
      + allow_forged_transmits            = true
      + allow_mac_changes                 = true
      + allow_promiscuous                 = true
      + auto_expand                       = true
      + block_all_ports                   = (known after apply)
      + check_beacon                      = (known after apply)
      + config_version                    = (known after apply)
      + directpath_gen2_allowed           = (known after apply)
      + distributed_virtual_switch_uuid   = (known after apply)
      + egress_shaping_average_bandwidth  = (known after apply)
      + egress_shaping_burst_size         = (known after apply)
      + egress_shaping_enabled            = (known after apply)
      + egress_shaping_peak_bandwidth     = (known after apply)
      + failback                          = (known after apply)
      + id                                = (known after apply)
      + ingress_shaping_average_bandwidth = (known after apply)
      + ingress_shaping_burst_size        = (known after apply)
      + ingress_shaping_enabled           = (known after apply)
      + ingress_shaping_peak_bandwidth    = (known after apply)
      + key                               = (known after apply)
      + lacp_enabled                      = (known after apply)
      + lacp_mode                         = (known after apply)
      + name                              = "bar"
      + netflow_enabled                   = (known after apply)
      + network_resource_pool_key         = "-1"
      + notify_switches                   = (known after apply)
      + number_of_ports                   = (known after apply)
      + port_private_secondary_vlan_id    = (known after apply)
      + standby_uplinks                   = (known after apply)
      + teaming_policy                    = (known after apply)
      + tx_uplink                         = (known after apply)
      + type                              = "earlyBinding"
      + vlan_id                           = 2001

      + vlan_range {
          + max_vlan = (known after apply)
          + min_vlan = (known after apply)
        }
    }

  # vsphere_distributed_virtual_switch.vds will be updated in-place
  ~ resource "vsphere_distributed_virtual_switch" "vds" {
      ~ description                       = "foo" -> "foo foo foo"
        id                                = "50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26"
        name                              = "foo"
        tags                              = []
        # (83 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
vsphere_distributed_virtual_switch.vds: Modifying... [id=50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26]
vsphere_distributed_virtual_switch.vds: Modifications complete after 0s [id=50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26]
data.vsphere_distributed_virtual_switch.vds: Reading...
data.vsphere_distributed_virtual_switch.vds: Read complete after 0s [id=50 02 1a bf ea ba c1 63-9f f1 d4 03 49 45 c5 26]
vsphere_distributed_port_group.dvpg: Creating...
vsphere_distributed_port_group.dvpg: Creation complete after 0s [id=dvportgroup-18020]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.
```

Which results in the following - But I did have to run it twice to the description, which is different that the issue reported.

<img width="956" alt="image" src="https://user-images.githubusercontent.com/7771363/139501950-1336f7ac-a4de-4a6d-a9ca-eb9d87b07909.png">

I should also mention that I do not get an error when changing the name of the VDS either.

Ryan